import EmblaCarousel from "../components/embla-carousel/TSX/EmblaCarousel";

const UserMomentsMemoriesP3Page = () => {
  // Register fade plugin here 👇
  const _datas: {
    img_url: string;
    mm_topic: { eng: string; nep: string };
    mm_des: { eng: string; nep: string };
  }[] = [
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/rhododendron-7.png",
      mm_topic: { eng: "Rhododendron For You", nep: "तिम्रो लागि लालीगुराँस" },
      mm_des: {
        eng: "I still remember giving you Laliguras. When I gave you the flower, I didn’t even look into your eyes because I was so shy!",
        nep: "म अझै पनि त्यो दिन याद गर्दछु जब मैले तिमीलाई लालीगुराँस दिएँ। फूल समातेर तिमीसम्म पुग्दा नै म निकै नराम्रोसँग डराएको जस्तो लजाएको थिएँ। तिमीले कसरी प्रतिक्रिया दिन्छ्यौ भन्ने अनिश्चितता थियो, त्यसैले तिम्रो आँखामा हेर्न नै सकिनँ। तर त्यो क्षण मेरो लागि खास थियो—सामान्य फूल होइन, साहस जोड़ेर दिएको पहिलो ‘gesture’ थियो।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/chattings-8.png",
      mm_topic: { eng: "Lots of Chattings", nep: "धेरै च्याट गर्ने दिनहरू" },
      mm_des: {
        eng: "Back when I was in class 10 and you were in class 12, those late-night chats were so much fun. I still don’t know who started the conversation first, but those chats were the first time I actually talked to someone that much.",
        nep: "जब म कक्षा १० मा थिएँ र तिमी १२ मा, हाम्रो ती रातिराति चल्ने कुरा कत्तिको रमाइलो हुन्थ्यो। कसले सुरु गर्थ्यो—तिमी कि म—अहिले पनि निश्चित छैन। तर कुरा सुरु भएपछि घण्टौँसम्म यस्तो सहज रूपमा बग्थ्यो कि त्यो पहिलो पटक थियो जहाँ मैले कसैसँग यत्तिको नजिक भएर कुरा गरेको थिएँ। ती रातहरूले नै मलाई कोही आफ्नो जस्तो महसुस गराएको थियो।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/attraction-9.png",
      mm_topic: { eng: "Attraction", nep: "आकर्षण" },
      mm_des: {
        eng: "Back in those days, I was amazed at how a girl could be so beautiful. I still remember your earrings, nose ring, and your shiny straight hair.",
        nep: "त्यो समय तिमीलाई देख्दा म साँचिकै अचम्म पर्थेँ—एउटी केटी यति साधारण तर यति सुन्दर कसरी हुन सक्छ? तिम्रा झुम्काले नजिकै आएर हल्का आवाज गर्थे, नाकको फुलीले मुस्कानमा छुट्टै चमक थप्थ्यो, र तिम्रो सोझो र चम्किलो कपालले तिम्रो अनुहारलाई अझै ‘highlight’ गर्थ्यो। ती साना साना कुरा नै तिम्रो आकर्षणलाई खास बनाउने तत्व थिए।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/tears-and-truth-10.png",
      mm_topic: { eng: "Tears & Truth", nep: "आँसु र वास्तविकता" },
      mm_des: {
        eng: "Maybe we remember each other even now because we used to share our ups and downs so openly and honestly.",
        nep: "सायद हामी एकअर्कालाई आजसम्म सम्झिनुका लागि सबैभन्दा ठूलो कारण के हो भने—हामी दुःख, तनाव, खुशी, डर सबै कुरा खुलामनले बाँड्थ्यौँ। कुनै ढोंग, कुनै दिखावा हुँदैनथ्यो। जब तिमीले आफ्नो कठिनाइका कुरा सुनाउँथ्यौ र म आफ्ना संघर्षहरू सुनाउँथेँ, त्यत्तिबेला लाग्थ्यो—यो मान्छे मलाई बुझ्छ। यही ‘truthfulness’ ले हाम्रो सम्झनालाई वर्षौँसम्म जोगाएर राख्यो।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/shy-boy-11.png",
      mm_topic: { eng: "Shy Boy", nep: "लजालु मान्छे" },
      mm_des: {
        eng: "I still feel shy remembering those moments — giving you a flower or meeting you outside your college.",
        nep: "तिम्रो कलेज बाहिर भेट्दा होस् वा तिमीलाई फूल दिँदा, म भित्रभित्र नै कति लजाइरहेको थिएँ। हात पसिना लागेको, आवाज कम्सिएको, नजर जमिनतिर झरेको—त्यो सबै स्मरण अहिले पनि दिमागमा fresh छ। खासमा त्यो लाज तिमी नजिक हुँदा मात्रै आउँथ्यो, किनकि म तिमीलाई ‘special’ मान्थेँ भन्ने त स्वयंलाई पनि थाहा थियो।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/crush-love-16.png",
      mm_topic: { eng: "Crush & Love", nep: "क्रस र भावना" },
      mm_des: {
        eng: "Even though I was shy, I had a crush on you. I feel a bit ashamed for disturbing you in the chats. Sorry for that.",
        nep: "म कति लजालु थिएँ, त्यो तिमी पनि जान्थ्यौ। तर त्यही लाजभित्र कतै तिमीप्रति सानो क्रसजस्तो भावना थियो। त्यसैले कहिलेकाहीँ हदभन्दा बढी च्याट गर्दा तिमीलाई disturb पर्न गएको होला भन्ने कुरा पछिल्लो केही वर्षमै महसुस भएको छ। त्यो समय बाल्य उमेर थियो, तर आज सोच्दा अलि लाज पनि लाग्छ, पछुतो पनि। त्यसका लागि म साच्चिकै माफी चाहन्छु।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/regret-12.png",
      mm_topic: { eng: "Regret", nep: "पछुतो" },
      mm_des: {
        eng: "I regret the moment I said bad words to you. You said it hurt you a lot. I still feel sorry for that even today.",
        nep: "त्यो दिन म आफैँको व्यवहारमाथि नियन्त्रण गर्न सकेन र तिमीलाई नराम्रो शब्द बोलेँ। तिमीले 'मलाई धेरै दुख्यो, कसैले मलाई कहिल्यै यस्तो भनेको छैन' भनेर लेखेको संदेश आजसम्म मेरो दिमागबाट हटेको छैन। त्यो क्षण मैले गल्ती गरेँ, र तिमीले पाएको चोटको बोझ म आजसम्म बोकिरहेको छु। त्यो गल्ती जीवनभरको पछुतो जस्तै छ।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/still-remembered-14.png",
      mm_topic: { eng: "Still Remembered", nep: "अझै सम्झिन्छु" },
      mm_des: {
        eng: "Whenever I disappeared and came back after many months, you still recognized me and talked normally like before. That always made me happy.",
        nep: "म धेरै महिनासम्म बेपत्ता जस्तै हुँदा पनि, एकदिन अचानक मेसिज पठाउँदा तिमीले तुरुन्तै चिनेको—‘ओ, फेरि आयौ र?’—भनेर सहज रूपमा कुरा गर्न थालेको कुरा अहिले पनि सम्झन्छु। यो कुरा खास थियो, किनकि धेरै समयपछि आए पनि तिम्रो व्यवहार कहिल्यै बदलिएको थिएन। त्यही निरन्तरताले मलाई हरेक चोटि खुसी बनाउँथ्यो।",
      },
    },
    {
      img_url:
        "https://cdn.jsdelivr.net/gh/dipak-w2003/unisha-verse@main/projects/imposter-entry/images/pillow-hug-15.png",
      mm_topic: { eng: "A Simple Hug", nep: "एउटा साधारण अँगालो" },
      mm_des: {
        eng: "The day you were returning from work, we walked together and I asked you for a simple hug. You said okay, and I hugged you gently. I really wanted that moment.",
        nep: "तिमी कामबाट फर्किँदै थियौ, म बीचमै भेटिएँ। हामी बिस्तारै हिँड्दै घरतिर लाग्यौँ। नदीछेउ पुग्दा धेरै समयदेखि मनमा राखेको कुरा बाहिर ल्याएँ—‘मलाई तिमीलाई एकछिन अँगालो हाल्न मन छ, मिल्छ?’ तिमीले मुस्कानसहित ‘ठिक छ’ भन्यौ। अनि मैले हल्का अँगालेँ। त्यो अँगालो लामो थिएन, तर मेरो मनमा बस्न पर्याप्त थियो। त्यो क्षण मैले धेरै समयदेखि कल्पना गरेको एउटा सानो इच्छा पूरा भएको जस्तो लाग्यो।",
      },
    },
  ];

  return (
    <div className="embla flex min-w-full relative  items-center justify-center h-dvh bg-[#3c3a3a] ">
      <EmblaCarousel slides={_datas} />
    </div>
  );
};

export default UserMomentsMemoriesP3Page;
